tutorials/Nozzle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x0 -0.2;
x1 -0.1014105357574873;
x2  0.1014105357574873;
y1 -3.887227224087052e-02;
y2  3.887227224087052e-02;
dz  0.01;

vertices
(
    ($x0 $y1 0)  // 0
    ($x1 $y1 0)  // 1
    ($x2 $y1 0)  // 2
    ($x0 $y2 0)  // 3
    ($x1 $y2 0)  // 4
    ($x2 $y2 0)  // 5
    ($x0 $y1 $dz)  // 6
    ($x1 $y1 $dz)  // 7
    ($x2 $y1 $dz)  // 8
    ($x0 $y2 $dz)  // 9
    ($x1 $y2 $dz)  // 10
    ($x2 $y2 $dz)  // 11

);

blocks
(
    hex (0 1 4 3 6 7 10 9)   (50 100 1)
    simpleGrading (1 ((10 30 100) (80 40 1) (10 30 0.01)) 1)
    hex (1 2 5 4 7 8 11 10)  (100 100 1)
    simpleGrading (1 ((10 30 100) (80 40 1) (10 30 0.01)) 1)
);

edges
(
    arc 1 2 (0 -0.030 0)
    arc 4 5 (0  0.030 0)
    arc 7 8 (0 -0.030 $dz)
    arc 10 11 (0 0.030 $dz)
    arc 2 5 (0.105 0 0)
    arc 8 11 (0.105 0 $dz)
    arc 1 4 (-0.105 0 0)
    arc 7 10 (-0.105 0 $dz)    
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }

    wall_upper
    {
        type wall;
        faces
            (
                (9 10 4 3)
                (10 11 5 4)
            );
    }
    
    wall_lower
    {
        type wall;
        faces
            (
                (0 1 7 6)
                (1 2 8 7)
            );
    }
    
    
);

mergePatchPairs
(
);

// ************************************************************************* //
