tutorials/Nozzle/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       IAPWSIF97;
    thermo          IAPWSIF97meta;
    equationOfState IAPWSIF97metaGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture  
{
    specie
    {
        molWeight       18.0153;
    }
}


saturationCurve IF97;

condensationModel momentum;

//surfaceTensionCorrection 1.194;
Kantrowitz on;

liquidProperties H2O_IAPWS;

// ************************************************************************* //
