tutorials/Nozzle/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 30000; //78390;

boundaryField
{
    inlet
    {
        type            totalPressure;
        rho none;
        psi thermo:psi;
        gamma 1.32;
        p0 uniform 78390;
        value $internalField;
    }

    outlet
    {
        type            zeroGradient; 
    }

    "wall_.*"
    {
        type slip;
    }
}


// ************************************************************************* //
