tutorials/Nozzle/0/Q2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      wetness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 2 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            inletOutlet;
        inletValue uniform 0;
        value uniform 0;
    }
    
    "wall.*"
    {
       type slip;
    }
}

// ************************************************************************* //
